Duet3D/Duet3Expansion/src/atmel/SAMD10_DFP/1.1.68/atdf/ATSAMD10D13AM.atdf
          <instance name="SERCOM2">
            <register-group name="SERCOM2" name-in-module="SERCOM" address-space="base" offset="0x42001000"/>
            <signals>
              <signal group="PAD" index="0" function="D" pad="PA14"/>
              <signal group="PAD" index="0" function="D" pad="PA22"/>
              <signal group="PAD" index="1" function="D" pad="PA15"/>
              <signal group="PAD" index="1" function="D" pad="PA23"/>
              <signal group="PAD" index="2" function="D" pad="PA10"/>
              <signal group="PAD" index="2" function="D" pad="PA16"/>
              <signal group="PAD" index="2" function="D" pad="PA24"/>
              <signal group="PAD" index="3" function="D" pad="PA11"/>
              <signal group="PAD" index="3" function="D" pad="PA17"/>
              <signal group="PAD" index="3" function="D" pad="PA25"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_RX" value="5"/>
              <param name="DMAC_ID_TX" value="6"/>
              <param name="GCLK_ID_CORE" value="16"/>
              <param name="GCLK_ID_SLOW" value="13"/>
              <param name="INT_MSB" value="6"/>
              <param name="INSTANCE_ID" value="68"/>
            </parameters>
          </instance>
        </module>
        <module name="SYSCTRL" id="U2100" version="2.0.2">
          <instance name="SYSCTRL">
            <register-group name="SYSCTRL" name-in-module="SYSCTRL" address-space="base" offset="0x40000800"/>
            <signals>
              <signal group="CAPLESS_EXTREF" function="VREG_TEST" pad="PA04"/>
              <signal group="CAPLESS_VDDCORE" function="VREG_TEST" pad="PA02"/>
              <signal group="ULPVREG_BODDETI" function="VREG_TEST" pad="PA06"/>
              <signal group="ULPVREG_BODDETII" function="VREG_TEST" pad="PA23"/>
              <signal group="ULPVREG_BODIEN" function="VREG_TEST" pad="PA03"/>
              <signal group="ULPVREG_BODIIEN" function="VREG_TEST" pad="PA05"/>
              <signal group="ULPVREG_ENABLE" function="VREG_TEST" pad="PA17"/>
              <signal group="ULPVREG_FORCELDO" function="VREG_TEST" pad="PA08"/>
              <signal group="ULPVREG_INC_BIAS" function="VREG_TEST" pad="PA11"/>
              <signal group="ULPVREG_LDOEN" function="VREG_TEST" pad="PA07"/>
              <signal group="ULPVREG_OSCEN" function="VREG_TEST" pad="PA22"/>
              <signal group="ULPVREG_REFRESH" function="VREG_TEST" pad="PA10"/>
              <signal group="ULPVREG_REFSEL" function="VREG_TEST" pad="PA16"/>
              <signal group="ULPVREG_REQBIAS" function="VREG_TEST" pad="PA09"/>
              <signal group="VREG_ENABLE" function="VREG_TEST" pad="PA24"/>
              <signal group="XIN" function="XIN" pad="PA08"/>
              <signal group="XIN32" function="XIN32" pad="PA08"/>
              <signal group="XOSC_CLK" function="XOSC_TEST" pad="PA15"/>
              <signal group="XOSC_EN" function="XOSC_TEST" pad="PA14"/>
              <signal group="XOUT32" function="XOUT32" pad="PA09"/>
            </signals>
            <parameters>
              <param name="BGAP_CALIB_MSB" value="11"/>
              <param name="BOD12_CALIB_MSB" value="4"/>
              <param name="BOD33_CALIB_MSB" value="5"/>
              <param name="DFLL48M_COARSE_MSB" value="5"/>
              <param name="DFLL48M_FINE_MSB" value="9"/>
              <param name="GCLK_ID_DFLL48" value="0"/>
              <param name="GCLK_ID_FDPLL" value="1"/>
              <param name="GCLK_ID_FDPLL32K" value="2"/>
              <param name="OSC32K_COARSE_CALIB_MSB" value="6"/>
              <param name="POR33_ENTEST_MSB" value="1"/>
              <param name="SYSTEM_CLOCK" value="1000000"/>
              <param name="ULPVREF_DIVLEV_MSB" value="3"/>
              <param name="ULPVREG_FORCEGAIN_MSB" value="1"/>
              <param name="ULPVREG_RAMREFSEL_MSB" value="2"/>
              <param name="VREF_CONTROL_MSB" value="48"/>
              <param name="VREF_STATUS_MSB" value="7"/>
              <param name="VREG_LEVEL_MSB" value="2"/>
              <param name="BOD12_VERSION" value="0x111"/>
              <param name="BOD33_VERSION" value="0x111"/>
              <param name="DFLL48M_VERSION" value="0x300"/>
              <param name="FDPLL_VERSION" value="0x110"/>
              <param name="OSCULP32K_VERSION" value="0x111"/>
              <param name="OSC8M_VERSION" value="0x120"/>
              <param name="OSC32K_VERSION" value="0x110"/>
              <param name="VREF_VERSION" value="0x201"/>
              <param name="VREG_VERSION" value="0x201"/>
              <param name="XOSC_VERSION" value="0x112"/>
              <param name="XOSC32K_VERSION" value="0x111"/>
              <param name="INSTANCE_ID" value="2"/>
            </parameters>
          </instance>
        </module>
        <module name="TC" id="U2212" version="1.4.0">
          <instance name="TC1">
            <register-group name="TC1" name-in-module="TC" address-space="base" offset="0x42001800"/>
            <signals>
              <signal group="WO" index="0" function="E" pad="PA04"/>
              <signal group="WO" index="0" function="E" pad="PA14"/>
              <signal group="WO" index="0" function="E" pad="PA16"/>
              <signal group="WO" index="0" function="E" pad="PA22"/>
              <signal group="WO" index="1" function="E" pad="PA05"/>
              <signal group="WO" index="1" function="E" pad="PA15"/>
              <signal group="WO" index="1" function="E" pad="PA17"/>
              <signal group="WO" index="1" function="E" pad="PA23"/>
            </signals>
            <parameters>
              <param name="CC8_NUM" value="2"/>
              <param name="CC16_NUM" value="2"/>
              <param name="CC32_NUM" value="2"/>
              <param name="DITHERING_EXT" value="0"/>
              <param name="DMAC_ID_OVF" value="12"/>
              <param name="GCLK_ID" value="18"/>
              <param name="MASTER" value="1"/>
              <param name="OW_NUM" value="2"/>
              <param name="PERIOD_EXT" value="0"/>
              <param name="SHADOW_EXT" value="0"/>
              <param name="INSTANCE_ID" value="70"/>
            </parameters>
          </instance>
          <instance name="TC2">
            <register-group name="TC2" name-in-module="TC" address-space="base" offset="0x42001C00"/>
            <signals>
              <signal group="WO" index="0" function="E" pad="PA06"/>
              <signal group="WO" index="0" function="E" pad="PA10"/>
              <signal group="WO" index="0" function="E" pad="PA30"/>
              <signal group="WO" index="1" function="E" pad="PA07"/>
              <signal group="WO" index="1" function="E" pad="PA11"/>
              <signal group="WO" index="1" function="E" pad="PA31"/>
            </signals>
            <parameters>
              <param name="CC8_NUM" value="2"/>
              <param name="CC16_NUM" value="2"/>
              <param name="CC32_NUM" value="2"/>
              <param name="DITHERING_EXT" value="0"/>
              <param name="DMAC_ID_OVF" value="15"/>
              <param name="GCLK_ID" value="18"/>
              <param name="MASTER" value="0"/>
              <param name="OW_NUM" value="2"/>
              <param name="PERIOD_EXT" value="0"/>
              <param name="SHADOW_EXT" value="0"/>
              <param name="INSTANCE_ID" value="71"/>
            </parameters>
          </instance>
        </module>
        <module name="TCC" id="U2213" version="1.1.1">
          <instance name="TCC0">
            <register-group name="TCC0" name-in-module="TCC" address-space="base" offset="0x42001400"/>
            <signals>
              <signal group="WO" index="0" function="F" pad="PA04"/>
              <signal group="WO" index="0" function="F" pad="PA14"/>
              <signal group="WO" index="1" function="F" pad="PA05"/>
              <signal group="WO" index="1" function="F" pad="PA15"/>
              <signal group="WO" index="2" function="F" pad="PA06"/>
              <signal group="WO" index="2" function="F" pad="PA10"/>
              <signal group="WO" index="2" function="F" pad="PA30"/>
              <signal group="WO" index="2" function="E" pad="PA08"/>
              <signal group="WO" index="2" function="E" pad="PA24"/>
              <signal group="WO" index="3" function="F" pad="PA07"/>
              <signal group="WO" index="3" function="F" pad="PA11"/>
              <signal group="WO" index="3" function="F" pad="PA31"/>
              <signal group="WO" index="3" function="E" pad="PA09"/>
              <signal group="WO" index="3" function="E" pad="PA25"/>
              <signal group="WO" index="4" function="F" pad="PA22"/>
              <signal group="WO" index="4" function="F" pad="PA24"/>
              <signal group="WO" index="4" function="F" pad="PA08"/>
              <signal group="WO" index="5" function="F" pad="PA23"/>
              <signal group="WO" index="5" function="F" pad="PA25"/>
              <signal group="WO" index="5" function="F" pad="PA09"/>
              <signal group="WO" index="6" function="F" pad="PA16"/>
              <signal group="WO" index="7" function="F" pad="PA17"/>
            </signals>
            <parameters>
              <param name="CC_NUM" value="4"/>
              <param name="DITHERING" value="1"/>
              <param name="DMAC_ID_OVF" value="7"/>
              <param name="DTI" value="1"/>
              <param name="EXT" value="31"/>
              <param name="GCLK_ID" value="17"/>
              <param name="MASTER" value="0"/>
              <param name="OTMX" value="1"/>
              <param name="OW_NUM" value="8"/>
              <param name="PG" value="1"/>
              <param name="SIZE" value="24"/>
              <param name="SWAP" value="1"/>
              <param name="INSTANCE_ID" value="69"/>
            </parameters>
          </instance>
        </module>
        <module name="WDT" id="U2203" version="2.0.0">
          <instance name="WDT">
            <register-group name="WDT" name-in-module="WDT" address-space="base" offset="0x40001000"/>
            <parameters>
              <param name="GCLK_ID" value="3"/>
              <param name="INSTANCE_ID" value="4"/>
            </parameters>
          </instance>
        </module>
      <module name="SystemControl">
          <instance name="SystemControl">
            <register-group address-space="base" offset="0xE000E000" name-in-module="SystemControl" name="SystemControl"/>
