Duet3D/Duet3Expansion/src/atmel/SAMD10_DFP/1.1.68/atdf/ATSAMD10D13AM.atdf
        <register name="GENCTRL" offset="0x4" rw="RW" access="WSYNC" size="4" initval="0x00000000" caption="Generic Clock Generator Control">
          <bitfield name="ID" caption="Generic Clock Generator Selection" mask="0xF"/>
          <bitfield name="SRC" caption="Source Select" mask="0x1F00" values="GCLK_GENCTRL__SRC"/>
          <bitfield name="GENEN" caption="Generic Clock Generator Enable" mask="0x10000"/>
          <bitfield name="IDC" caption="Improve Duty Cycle" mask="0x20000"/>
          <bitfield name="OOV" caption="Output Off Value" mask="0x40000"/>
          <bitfield name="OE" caption="Output Enable" mask="0x80000"/>
          <bitfield name="DIVSEL" caption="Divide Selection" mask="0x100000"/>
          <bitfield name="RUNSTDBY" caption="Run in Standby" mask="0x200000"/>
        </register>
        <register name="GENDIV" offset="0x8" rw="RW" size="4" initval="0x00000000" caption="Generic Clock Generator Division">
          <bitfield name="ID" caption="Generic Clock Generator Selection" mask="0xF"/>
          <bitfield name="DIV" caption="Division Factor" mask="0xFFFF00"/>
        </register>
      </register-group>
      <value-group name="GCLK_CLKCTRL__GEN">
        <value name="GCLK0" caption="Generic clock generator 0" value="0x0"/>
        <value name="GCLK1" caption="Generic clock generator 1" value="0x1"/>
        <value name="GCLK2" caption="Generic clock generator 2" value="0x2"/>
        <value name="GCLK3" caption="Generic clock generator 3" value="0x3"/>
        <value name="GCLK4" caption="Generic clock generator 4" value="0x4"/>
        <value name="GCLK5" caption="Generic clock generator 5" value="0x5"/>
      </value-group>
      <value-group name="GCLK_CLKCTRL__ID">
        <value name="DFLL48" caption="DFLL48" value="0x0"/>
        <value name="FDPLL" caption="FDPLL" value="0x1"/>
        <value name="FDPLL32K" caption="FDPLL32K" value="0x2"/>
        <value name="WDT" caption="WDT" value="0x3"/>
        <value name="RTC" caption="RTC" value="0x4"/>
        <value name="EIC" caption="EIC" value="0x5"/>
        <value name="EVSYS_0" caption="EVSYS_0" value="0x7"/>
        <value name="EVSYS_1" caption="EVSYS_1" value="0x8"/>
        <value name="EVSYS_2" caption="EVSYS_2" value="0x9"/>
        <value name="EVSYS_3" caption="EVSYS_3" value="0xA"/>
        <value name="EVSYS_4" caption="EVSYS_4" value="0xB"/>
        <value name="EVSYS_5" caption="EVSYS_5" value="0xC"/>
        <value name="SERCOMX_SLOW" caption="SERCOMX_SLOW" value="0xD"/>
        <value name="SERCOM0_CORE" caption="SERCOM0_CORE" value="0xE"/>
        <value name="SERCOM1_CORE" caption="SERCOM1_CORE" value="0xF"/>
        <value name="SERCOM2_CORE" caption="SERCOM2_CORE" value="0x10"/>
        <value name="TCC0" caption="TCC0" value="0x11"/>
        <value name="TC1_TC2" caption="TC1_TC2" value="0x12"/>
        <value name="ADC" caption="ADC" value="0x13"/>
        <value name="AC_DIG" caption="AC_DIG" value="0x14"/>
        <value name="AC_ANA" caption="AC_ANA" value="0x15"/>
        <value name="DAC" caption="DAC" value="0x16"/>
      </value-group>
      <value-group name="GCLK_GENCTRL__SRC">
        <value name="XOSC" caption="XOSC oscillator output" value="0"/>
        <value name="GCLKIN" caption="Generator input pad" value="1"/>
        <value name="GCLKGEN1" caption="Generic clock generator 1 output" value="2"/>
        <value name="OSCULP32K" caption="OSCULP32K oscillator output" value="3"/>
        <value name="OSC32K" caption="OSC32K oscillator output" value="4"/>
        <value name="XOSC32K" caption="XOSC32K oscillator output" value="5"/>
        <value name="OSC8M" caption="OSC8M oscillator output" value="6"/>
        <value name="DFLL48M" caption="DFLL48M output" value="7"/>
        <value name="FDPLL" caption="FDPLL output" value="8"/>
      </value-group>
    </module>
    <module name="HMATRIXB" id="I7638" version="2.1.2" caption="HSB Matrix">
      <register-group name="PRS" size="0x8">
        <register name="PRAS" offset="0x0" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Priority A for Slave">
          <bitfield name="M0PR" caption="Master 0 Priority" mask="0xF"/>
          <bitfield name="M1PR" caption="Master 1 Priority" mask="0xF0"/>
          <bitfield name="M2PR" caption="Master 2 Priority" mask="0xF00"/>
          <bitfield name="M3PR" caption="Master 3 Priority" mask="0xF000"/>
          <bitfield name="M4PR" caption="Master 4 Priority" mask="0xF0000"/>
          <bitfield name="M5PR" caption="Master 5 Priority" mask="0xF00000"/>
          <bitfield name="M6PR" caption="Master 6 Priority" mask="0xF000000"/>
          <bitfield name="M7PR" caption="Master 7 Priority" mask="0xF0000000"/>
        </register>
        <register name="PRBS" offset="0x4" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Priority B for Slave">
          <bitfield name="M8PR" caption="Master 8 Priority" mask="0xF"/>
          <bitfield name="M9PR" caption="Master 9 Priority" mask="0xF0"/>
          <bitfield name="M10PR" caption="Master 10 Priority" mask="0xF00"/>
          <bitfield name="M11PR" caption="Master 11 Priority" mask="0xF000"/>
          <bitfield name="M12PR" caption="Master 12 Priority" mask="0xF0000"/>
          <bitfield name="M13PR" caption="Master 13 Priority" mask="0xF00000"/>
          <bitfield name="M14PR" caption="Master 14 Priority" mask="0xF000000"/>
          <bitfield name="M15PR" caption="Master 15 Priority" mask="0xF0000000"/>
        </register>
      </register-group>
      <register-group name="HMATRIXB" caption="HSB Matrix">
        <register-group name="PRS" name-in-module="PRS" offset="0x080" count="16"/>
        <register name="SFR" offset="0x110" rw="RW" size="4" access-size="4" count="16" initval="0x00000000" caption="Special Function">
          <bitfield name="SFR" caption="Special Function Register" mask="0xFFFFFFFF"/>
        </register>
      </register-group>
    </module>
    <module name="MTB" id="U2002" version="1.0.0" caption="Cortex-M0+ Micro-Trace Buffer">
      <register-group name="MTB" caption="Cortex-M0+ Micro-Trace Buffer">
        <register name="POSITION" offset="0x0" rw="RW" size="4" access-size="4" caption="MTB Position">
          <bitfield name="WRAP" caption="Pointer Value Wraps" mask="0x4"/>
          <bitfield name="POINTER" caption="Trace Packet Location Pointer" mask="0xFFFFFFF8"/>
        </register>
        <register name="MASTER" offset="0x4" rw="RW" size="4" access-size="4" initval="0x00000000" caption="MTB Master">
          <bitfield name="MASK" caption="Maximum Value of the Trace Buffer in SRAM" mask="0x1F"/>
          <bitfield name="TSTARTEN" caption="Trace Start Input Enable" mask="0x20"/>
          <bitfield name="TSTOPEN" caption="Trace Stop Input Enable" mask="0x40"/>
          <bitfield name="SFRWPRIV" caption="Special Function Register Write Privilege" mask="0x80"/>
          <bitfield name="RAMPRIV" caption="SRAM Privilege" mask="0x100"/>
          <bitfield name="HALTREQ" caption="Halt Request" mask="0x200"/>
          <bitfield name="EN" caption="Main Trace Enable" mask="0x80000000"/>
        </register>
        <register name="FLOW" offset="0x8" rw="RW" size="4" access-size="4" initval="0x00000000" caption="MTB Flow">
          <bitfield name="AUTOSTOP" caption="Auto Stop Tracing" mask="0x1"/>
          <bitfield name="AUTOHALT" caption="Auto Halt Request" mask="0x2"/>
          <bitfield name="WATERMARK" caption="Watermark value" mask="0xFFFFFFF8"/>
        </register>
        <register name="BASE" offset="0xC" rw="R" size="4" access-size="4" caption="MTB Base">
        </register>
        <register name="ITCTRL" offset="0xF00" rw="RW" size="4" access-size="4" caption="MTB Integration Mode Control">
        </register>
        <register name="CLAIMSET" offset="0xFA0" rw="RW" size="4" access-size="4" atomic-op="set:CLAIMSET" caption="MTB Claim Set">
        </register>
        <register name="CLAIMCLR" offset="0xFA4" rw="RW" size="4" access-size="4" atomic-op="clear:CLAIMCLR" caption="MTB Claim Clear">
        </register>
        <register name="LOCKACCESS" offset="0xFB0" rw="RW" size="4" access-size="4" caption="MTB Lock Access">
        </register>
        <register name="LOCKSTATUS" offset="0xFB4" rw="R" size="4" access-size="4" caption="MTB Lock Status">
        </register>
        <register name="AUTHSTATUS" offset="0xFB8" rw="R" size="4" access-size="4" caption="MTB Authentication Status">
        </register>
        <register name="DEVARCH" offset="0xFBC" rw="R" size="4" access-size="4" caption="MTB Device Architecture">
        </register>
        <register name="DEVID" offset="0xFC8" rw="R" size="4" access-size="4" caption="MTB Device Configuration">
        </register>
        <register name="DEVTYPE" offset="0xFCC" rw="R" size="4" access-size="4" caption="MTB Device Type">
        </register>
        <register name="PID4" offset="0xFD0" rw="R" size="4" access-size="4" caption="CoreSight">
        </register>
        <register name="PID5" offset="0xFD4" rw="R" size="4" access-size="4" caption="CoreSight">
        </register>
        <register name="PID6" offset="0xFD8" rw="R" size="4" access-size="4" caption="CoreSight">
        </register>
        <register name="PID7" offset="0xFDC" rw="R" size="4" access-size="4" caption="CoreSight">
        </register>
